Sloeber/arduino-eclipse-plugin/teensy/configuration/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.keys=Keyboard Layout


teensy2.name=Teensy 2.0
teensy2.upload.protocol=halfkay
teensy2.upload.maximum_size=32256
teensy2.upload.maximum_ram_size=2560
teensy2.upload.speed=12000000
teensy2.upload.disable_flushing=true
teensy2.bootloader.path=undefined
teensy2.serial.restart_cmd=true
teensy2.serial.safe_baud_rates_only=true
teensy2.upload.tool=teensy_reboot
teensy2.build.mcu=atmega32u4
teensy2.build.core=teensy
teensy2.build.elide_constructors=true
teensy2.build.cpp0x=true
teensy2.build.dependency=true
teensy2.build.linker_relaxation=true
teensy2.build.post_compile_script=teensy_post_compile
teensy2.build.serial_number=true
menu.usb.teensy2.serial=Serial
menu.usb.teensy2.serial.build.define0=-DUSB_SERIAL
menu.usb.teensy2.hid=Keyboard + Mouse + Joystick
menu.usb.teensy2.hid.build.define0=-DUSB_HID
menu.usb.teensy2.hid.fake_serial=teensy_gateway
menu.usb.teensy2.serialhid=Serial + Keyboard + Mouse + Joystick
menu.usb.teensy2.serialhid.build.define0=-DUSB_SERIAL_HID
menu.usb.teensy2.int_disk=Disk(Internal) + Keyboard
menu.usb.teensy2.int_disk.build.define0=-DUSB_DISK
menu.usb.teensy2.int_disk.fake_serial=teensy_gateway
menu.usb.teensy2.int_disk.build.elfpatch=mktinyfat
menu.usb.teensy2.sd_disk=Disk(SD Card) + Keyboard
menu.usb.teensy2.sd_disk.build.define0=-DUSB_DISK_SDFLASH
menu.usb.teensy2.sd_disk.fake_serial=teensy_gateway
menu.usb.teensy2.midi=MIDI
menu.usb.teensy2.midi.build.define0=-DUSB_MIDI
menu.usb.teensy2.midi.fake_serial=teensy_gateway
menu.usb.teensy2.rawhid=Raw HID
menu.usb.teensy2.rawhid.build.define0=-DUSB_RAWHID
menu.usb.teensy2.rawhid.fake_serial=teensy_gateway
menu.usb.teensy2.flightsim=Flight Sim Controls
menu.usb.teensy2.flightsim.build.define0=-DUSB_FLIGHTSIM
menu.usb.teensy2.flightsim.fake_serial=teensy_gateway
menu.speed.teensy2.16=16 MHz
menu.speed.teensy2.8=8 MHz
menu.speed.teensy2.4=4 MHz
menu.speed.teensy2.2=2 MHz
menu.speed.teensy2.1=1 MHz
menu.speed.teensy2.16.build.f_cpu=16000000L
menu.speed.teensy2.8.build.f_cpu=8000000L
menu.speed.teensy2.4.build.f_cpu=4000000L
menu.speed.teensy2.2.build.f_cpu=2000000L
menu.speed.teensy2.1.build.f_cpu=1000000L
menu.keys.teensy2.en-us=US English
menu.keys.teensy2.en-us.build.define1=-DLAYOUT_US_ENGLISH
menu.keys.teensy2.fr-ca=Canadian French
menu.keys.teensy2.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
menu.keys.teensy2.xx-ca=Canadian Multilingual
menu.keys.teensy2.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
menu.keys.teensy2.da-da=Danish
menu.keys.teensy2.da-da.build.define1=-DLAYOUT_DANISH
menu.keys.teensy2.fi-fi=Finnish
menu.keys.teensy2.fi-fi.build.define1=-DLAYOUT_FINNISH
menu.keys.teensy2.fr-fr=French
menu.keys.teensy2.fr-fr.build.define1=-DLAYOUT_FRENCH
menu.keys.teensy2.fr-be=French Belgian
menu.keys.teensy2.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
menu.keys.teensy2.fr-ch=French Swiss
menu.keys.teensy2.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
menu.keys.teensy2.de-de=German
menu.keys.teensy2.de-de.build.define1=-DLAYOUT_GERMAN
menu.keys.teensy2.de-dm=German (Mac)
menu.keys.teensy2.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
menu.keys.teensy2.de-ch=German Swiss
menu.keys.teensy2.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
menu.keys.teensy2.is-is=Icelandic
menu.keys.teensy2.is-is.build.define1=-DLAYOUT_ICELANDIC
menu.keys.teensy2.en-ie=Irish
menu.keys.teensy2.en-ie.build.define1=-DLAYOUT_IRISH
menu.keys.teensy2.it-it=Italian
menu.keys.teensy2.it-it.build.define1=-DLAYOUT_ITALIAN
menu.keys.teensy2.no-no=Norwegian
menu.keys.teensy2.no-no.build.define1=-DLAYOUT_NORWEGIAN
menu.keys.teensy2.pt-pt=Portuguese
menu.keys.teensy2.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
menu.keys.teensy2.pt-br=Portuguese Brazilian
menu.keys.teensy2.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
menu.keys.teensy2.es-es=Spanish
menu.keys.teensy2.es-es.build.define1=-DLAYOUT_SPANISH
menu.keys.teensy2.es-mx=Spanish Latin America
menu.keys.teensy2.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
menu.keys.teensy2.sv-se=Swedish
menu.keys.teensy2.sv-se.build.define1=-DLAYOUT_SWEDISH
menu.keys.teensy2.en-gb=United Kingdom
menu.keys.teensy2.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
menu.keys.teensy2.usint=US International
menu.keys.teensy2.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensy1.name=Teensy 1.0
teensy1.upload.protocol=halfkay
teensy1.upload.maximum_size=15872
teensy1.upload.maximum_ram_size=512
teensy1.upload.speed=12000000
teensy1.upload.disable_flushing=true
teensy1.bootloader.path=undefined
teensy1.serial.restart_cmd=true
teensy1.serial.safe_baud_rates_only=true
teensy1.upload.tool=teensy_reboot
teensy1.build.mcu=at90usb162
teensy1.build.core=teensy
teensy1.build.elide_constructors=true
teensy1.build.cpp0x=true
teensy1.build.dependency=true
teensy1.build.linker_relaxation=true
teensy1.build.post_compile_script=teensy_post_compile
menu.usb.teensy1.serial=Serial
menu.usb.teensy1.serial.build.define0=-DUSB_SERIAL
menu.usb.teensy1.hid=Keyboard + Mouse
menu.usb.teensy1.hid.build.define0=-DUSB_HID
menu.usb.teensy1.hid.fake_serial=teensy_gateway
menu.speed.teensy1.16=16 MHz
menu.speed.teensy1.8=8 MHz
menu.speed.teensy1.4=4 MHz
menu.speed.teensy1.2=2 MHz
menu.speed.teensy1.1=1 MHz
menu.speed.teensy1.16.build.f_cpu=16000000L
menu.speed.teensy1.8.build.f_cpu=8000000L
menu.speed.teensy1.4.build.f_cpu=4000000L
menu.speed.teensy1.2.build.f_cpu=2000000L
menu.speed.teensy1.1.build.f_cpu=1000000L
menu.keys.teensy1.en-us=US English
menu.keys.teensy1.en-us.build.define1=-DLAYOUT_US_ENGLISH
menu.keys.teensy1.fr-ca=Canadian French
menu.keys.teensy1.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
menu.keys.teensy1.xx-ca=Canadian Multilingual
menu.keys.teensy1.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
menu.keys.teensy1.da-da=Danish
menu.keys.teensy1.da-da.build.define1=-DLAYOUT_DANISH
menu.keys.teensy1.fi-fi=Finnish
menu.keys.teensy1.fi-fi.build.define1=-DLAYOUT_FINNISH
menu.keys.teensy1.fr-fr=French
menu.keys.teensy1.fr-fr.build.define1=-DLAYOUT_FRENCH
menu.keys.teensy1.fr-be=French Belgian
menu.keys.teensy1.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
menu.keys.teensy1.fr-ch=French Swiss
menu.keys.teensy1.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
menu.keys.teensy1.de-de=German
menu.keys.teensy1.de-de.build.define1=-DLAYOUT_GERMAN
menu.keys.teensy1.de-dm=German (Mac)
menu.keys.teensy1.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
menu.keys.teensy1.de-ch=German Swiss
menu.keys.teensy1.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
menu.keys.teensy1.is-is=Icelandic
menu.keys.teensy1.is-is.build.define1=-DLAYOUT_ICELANDIC
menu.keys.teensy1.en-ie=Irish
menu.keys.teensy1.en-ie.build.define1=-DLAYOUT_IRISH
menu.keys.teensy1.it-it=Italian
menu.keys.teensy1.it-it.build.define1=-DLAYOUT_ITALIAN
menu.keys.teensy1.no-no=Norwegian
menu.keys.teensy1.no-no.build.define1=-DLAYOUT_NORWEGIAN
menu.keys.teensy1.pt-pt=Portuguese
menu.keys.teensy1.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
menu.keys.teensy1.pt-br=Portuguese Brazilian
menu.keys.teensy1.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
menu.keys.teensy1.es-es=Spanish
menu.keys.teensy1.es-es.build.define1=-DLAYOUT_SPANISH
menu.keys.teensy1.es-mx=Spanish Latin America
menu.keys.teensy1.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
menu.keys.teensy1.sv-se=Swedish
menu.keys.teensy1.sv-se.build.define1=-DLAYOUT_SWEDISH
menu.keys.teensy1.en-gb=United Kingdom
menu.keys.teensy1.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
menu.keys.teensy1.usint=US International
menu.keys.teensy1.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensypp2.name=Teensy++ 2.0
teensypp2.upload.protocol=halfkay
teensypp2.upload.maximum_size=130048
teensypp2.upload.maximum_ram_size=8192
teensypp2.upload.speed=12000000
teensypp2.upload.disable_flushing=true
teensypp2.bootloader.path=undefined
teensypp2.serial.restart_cmd=true
teensypp2.serial.safe_baud_rates_only=true
teensypp2.upload.tool=teensy_reboot
teensypp2.build.mcu=at90usb1286
teensypp2.build.core=teensy
teensypp2.build.elide_constructors=true
teensypp2.build.cpp0x=true
teensypp2.build.dependency=true
teensypp2.build.linker_relaxation=true
teensypp2.build.post_compile_script=teensy_post_compile
teensypp2.build.serial_number=true
menu.usb.teensypp2.serial=Serial
menu.usb.teensypp2.serial.build.define0=-DUSB_SERIAL
menu.usb.teensypp2.hid=Keyboard + Mouse + Joystick
menu.usb.teensypp2.hid.build.define0=-DUSB_HID
menu.usb.teensypp2.hid.fake_serial=teensy_gateway
menu.usb.teensypp2.serialhid=Serial + Keyboard + Mouse + Joystick
menu.usb.teensypp2.serialhid.build.define0=-DUSB_SERIAL_HID
menu.usb.teensypp2.int_disk=Disk(Internal) + Keyboard
menu.usb.teensypp2.int_disk.build.define0=-DUSB_DISK
menu.usb.teensypp2.int_disk.fake_serial=teensy_gateway
menu.usb.teensypp2.int_disk.build.elfpatch=mktinyfat
menu.usb.teensypp2.sd_disk=Disk(SD Card) + Keyboard
menu.usb.teensypp2.sd_disk.build.define0=-DUSB_DISK_SDFLASH
menu.usb.teensypp2.sd_disk.fake_serial=teensy_gateway
menu.usb.teensypp2.midi=MIDI
menu.usb.teensypp2.midi.build.define0=-DUSB_MIDI
menu.usb.teensypp2.midi.fake_serial=teensy_gateway
menu.usb.teensypp2.rawhid=Raw HID
menu.usb.teensypp2.rawhid.build.define0=-DUSB_RAWHID
menu.usb.teensypp2.rawhid.fake_serial=teensy_gateway
menu.usb.teensypp2.flightsim=Flight Sim Controls
menu.usb.teensypp2.flightsim.build.define0=-DUSB_FLIGHTSIM
menu.usb.teensypp2.flightsim.fake_serial=teensy_gateway
menu.speed.teensypp2.16=16 MHz
menu.speed.teensypp2.8=8 MHz
menu.speed.teensypp2.4=4 MHz
menu.speed.teensypp2.2=2 MHz
menu.speed.teensypp2.1=1 MHz
menu.speed.teensypp2.16.build.f_cpu=16000000L
menu.speed.teensypp2.8.build.f_cpu=8000000L
menu.speed.teensypp2.4.build.f_cpu=4000000L
menu.speed.teensypp2.2.build.f_cpu=2000000L
menu.speed.teensypp2.1.build.f_cpu=1000000L
menu.keys.teensypp2.en-us=US English
menu.keys.teensypp2.en-us.build.define1=-DLAYOUT_US_ENGLISH
menu.keys.teensypp2.fr-ca=Canadian French
menu.keys.teensypp2.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
menu.keys.teensypp2.xx-ca=Canadian Multilingual
menu.keys.teensypp2.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
menu.keys.teensypp2.da-da=Danish
menu.keys.teensypp2.da-da.build.define1=-DLAYOUT_DANISH
menu.keys.teensypp2.fi-fi=Finnish
menu.keys.teensypp2.fi-fi.build.define1=-DLAYOUT_FINNISH
menu.keys.teensypp2.fr-fr=French
menu.keys.teensypp2.fr-fr.build.define1=-DLAYOUT_FRENCH
menu.keys.teensypp2.fr-be=French Belgian
menu.keys.teensypp2.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
menu.keys.teensypp2.fr-ch=French Swiss
menu.keys.teensypp2.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
menu.keys.teensypp2.de-de=German
menu.keys.teensypp2.de-de.build.define1=-DLAYOUT_GERMAN
menu.keys.teensypp2.de-dm=German (Mac)
menu.keys.teensypp2.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
menu.keys.teensypp2.de-ch=German Swiss
menu.keys.teensypp2.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
menu.keys.teensypp2.is-is=Icelandic
menu.keys.teensypp2.is-is.build.define1=-DLAYOUT_ICELANDIC
menu.keys.teensypp2.en-ie=Irish
menu.keys.teensypp2.en-ie.build.define1=-DLAYOUT_IRISH
menu.keys.teensypp2.it-it=Italian
menu.keys.teensypp2.it-it.build.define1=-DLAYOUT_ITALIAN
menu.keys.teensypp2.no-no=Norwegian
menu.keys.teensypp2.no-no.build.define1=-DLAYOUT_NORWEGIAN
menu.keys.teensypp2.pt-pt=Portuguese
menu.keys.teensypp2.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
menu.keys.teensypp2.pt-br=Portuguese Brazilian
menu.keys.teensypp2.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
menu.keys.teensypp2.es-es=Spanish
menu.keys.teensypp2.es-es.build.define1=-DLAYOUT_SPANISH
menu.keys.teensypp2.es-mx=Spanish Latin America
menu.keys.teensypp2.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
menu.keys.teensypp2.sv-se=Swedish
menu.keys.teensypp2.sv-se.build.define1=-DLAYOUT_SWEDISH
menu.keys.teensypp2.en-gb=United Kingdom
menu.keys.teensypp2.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
menu.keys.teensypp2.usint=US International
menu.keys.teensypp2.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensypp1.name=Teensy++ 1.0
teensypp1.upload.protocol=halfkay
teensypp1.upload.maximum_size=64512
teensypp1.upload.maximum_ram_size=4096
teensypp1.upload.speed=12000000
teensypp1.upload.disable_flushing=true
teensypp1.bootloader.path=undefined
teensypp1.serial.restart_cmd=true
teensypp1.serial.safe_baud_rates_only=true
teensypp1.upload.tool=teensy_reboot
teensypp1.build.mcu=at90usb646
teensypp1.build.core=teensy
teensypp1.build.elide_constructors=true
teensypp1.build.cpp0x=true
teensypp1.build.dependency=true
teensypp1.build.linker_relaxation=true
teensypp1.build.post_compile_script=teensy_post_compile
teensypp1.build.serial_number=true
menu.usb.teensypp1.serial=Serial
menu.usb.teensypp1.serial.build.define0=-DUSB_SERIAL
menu.usb.teensypp1.hid=Keyboard + Mouse + Joystick
menu.usb.teensypp1.hid.build.define0=-DUSB_HID
menu.usb.teensypp1.hid.fake_serial=teensy_gateway
menu.usb.teensypp1.serialhid=Serial + Keyboard + Mouse + Joystick
menu.usb.teensypp1.serialhid.build.define0=-DUSB_SERIAL_HID
menu.usb.teensypp1.int_disk=Disk(Internal) + Keyboard
menu.usb.teensypp1.int_disk.build.define0=-DUSB_DISK
menu.usb.teensypp1.int_disk.fake_serial=teensy_gateway
menu.usb.teensypp1.int_disk.build.elfpatch=mktinyfat
menu.usb.teensypp1.sd_disk=Disk(SD Card) + Keyboard
menu.usb.teensypp1.sd_disk.build.define0=-DUSB_DISK_SDFLASH
menu.usb.teensypp1.sd_disk.fake_serial=teensy_gateway
menu.usb.teensypp1.midi=MIDI
menu.usb.teensypp1.midi.build.define0=-DUSB_MIDI
menu.usb.teensypp1.midi.fake_serial=teensy_gateway
menu.usb.teensypp1.rawhid=Raw HID
menu.usb.teensypp1.rawhid.build.define0=-DUSB_RAWHID
menu.usb.teensypp1.rawhid.fake_serial=teensy_gateway
menu.speed.teensypp1.16=16 MHz
menu.speed.teensypp1.8=8 MHz
menu.speed.teensypp1.4=4 MHz
menu.speed.teensypp1.2=2 MHz
menu.speed.teensypp1.1=1 MHz
menu.speed.teensypp1.16.build.f_cpu=16000000L
menu.speed.teensypp1.8.build.f_cpu=8000000L
menu.speed.teensypp1.4.build.f_cpu=4000000L
menu.speed.teensypp1.2.build.f_cpu=2000000L
menu.speed.teensypp1.1.build.f_cpu=1000000L
menu.keys.teensypp1.en-us=US English
menu.keys.teensypp1.en-us.build.define1=-DLAYOUT_US_ENGLISH
menu.keys.teensypp1.fr-ca=Canadian French
menu.keys.teensypp1.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
menu.keys.teensypp1.xx-ca=Canadian Multilingual
menu.keys.teensypp1.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
menu.keys.teensypp1.da-da=Danish
menu.keys.teensypp1.da-da.build.define1=-DLAYOUT_DANISH
menu.keys.teensypp1.fi-fi=Finnish
menu.keys.teensypp1.fi-fi.build.define1=-DLAYOUT_FINNISH
menu.keys.teensypp1.fr-fr=French
menu.keys.teensypp1.fr-fr.build.define1=-DLAYOUT_FRENCH
menu.keys.teensypp1.fr-be=French Belgian
menu.keys.teensypp1.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
menu.keys.teensypp1.fr-ch=French Swiss
menu.keys.teensypp1.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
menu.keys.teensypp1.de-de=German
menu.keys.teensypp1.de-de.build.define1=-DLAYOUT_GERMAN
menu.keys.teensypp1.de-dm=German (Mac)
menu.keys.teensypp1.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
menu.keys.teensypp1.de-ch=German Swiss
menu.keys.teensypp1.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
menu.keys.teensypp1.is-is=Icelandic
menu.keys.teensypp1.is-is.build.define1=-DLAYOUT_ICELANDIC
menu.keys.teensypp1.en-ie=Irish
menu.keys.teensypp1.en-ie.build.define1=-DLAYOUT_IRISH
menu.keys.teensypp1.it-it=Italian
menu.keys.teensypp1.it-it.build.define1=-DLAYOUT_ITALIAN
menu.keys.teensypp1.no-no=Norwegian
menu.keys.teensypp1.no-no.build.define1=-DLAYOUT_NORWEGIAN
menu.keys.teensypp1.pt-pt=Portuguese
menu.keys.teensypp1.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
menu.keys.teensypp1.pt-br=Portuguese Brazilian
menu.keys.teensypp1.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
menu.keys.teensypp1.es-es=Spanish
menu.keys.teensypp1.es-es.build.define1=-DLAYOUT_SPANISH
menu.keys.teensypp1.es-mx=Spanish Latin America
menu.keys.teensypp1.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
menu.keys.teensypp1.sv-se=Swedish
menu.keys.teensypp1.sv-se.build.define1=-DLAYOUT_SWEDISH
menu.keys.teensypp1.en-gb=United Kingdom
menu.keys.teensypp1.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
menu.keys.teensypp1.usint=US International
menu.keys.teensypp1.usint.build.define1=-DLAYOUT_US_INTERNATIONAL


