Sloeber/arduino-eclipse-plugin/teensy/configuration/boards.txt
teensy3.name=Teensy 3.0
teensy3.upload.protocol=halfkay
teensy3.upload.maximum_size=131072
teensy3.upload.maximum_ram_size=16384
teensy3.upload.speed=12000000
teensy3.upload.disable_flushing=true
teensy3.bootloader.path=undefined
teensy3.serial.restart_cmd=true
teensy3.serial.safe_baud_rates_only=true
teensy3.upload.tool=teensy_reboot
teensy3.build.mcu=cortex-m4
teensy3.build.cpu=cortex-m4
teensy3.build.option1=-mthumb
teensy3.build.option2=-nostdlib
teensy3.build.option3=-D__MK20DX128__
teensy3.build.cppoption1=-fno-rtti
teensy3.build.linkoption1=-mthumb 
teensy3.build.linkscript=mk20dx128.ld
teensy3.build.architecture=arm-none-eabi
teensy3.build.command.gcc=arm-none-eabi-gcc
teensy3.build.command.g++=arm-none-eabi-g++
teensy3.build.command.ar=arm-none-eabi-ar
teensy3.build.command.objcopy=arm-none-eabi-objcopy
teensy3.build.command.objdump=arm-none-eabi-objdump
teensy3.build.command.size=arm-none-eabi-size
teensy3.build.core=teensy3
teensy3.build.noarchive=true
teensy3.build.elide_constructors=true
teensy3.build.gnu0x=true
teensy3.build.dependency=true
teensy3.build.time_t=true
teensy3.build.ldscript=teensy/all/cores/teensy3/mk20dx128.ld
#teensy3.build.linker_relaxation=true
teensy3.build.post_compile_script=teensy_post_compile
#teensy3.build.serial_number=true
menu.usb.teensy3.serial=Serial
menu.usb.teensy3.serial.build.define0=-DUSB_SERIAL
menu.usb.teensy3.hid=Keyboard + Mouse + Joystick
menu.usb.teensy3.hid.build.define0=-DUSB_HID
menu.usb.teensy3.hid.fake_serial=teensy_gateway
menu.usb.teensy3.serialhid=Serial + Keyboard + Mouse + Joystick
menu.usb.teensy3.serialhid.build.define0=-DUSB_SERIAL_HID
#menu.usb.teensy3.int_disk=Disk(Internal) + Keyboard
#menu.usb.teensy3.int_disk.build.define0=-DUSB_DISK
#menu.usb.teensy3.int_disk.fake_serial=teensy_gateway
#menu.usb.teensy3.int_disk.build.elfpatch=mktinyfat
#menu.usb.teensy3.sd_disk=Disk(SD Card) + Keyboard
#menu.usb.teensy3.sd_disk.build.define0=-DUSB_DISK_SDFLASH
#menu.usb.teensy3.sd_disk.fake_serial=teensy_gateway
menu.usb.teensy3.midi=MIDI
menu.usb.teensy3.midi.build.define0=-DUSB_MIDI
menu.usb.teensy3.midi.fake_serial=teensy_gateway
menu.usb.teensy3.rawhid=Raw HID
menu.usb.teensy3.rawhid.build.define0=-DUSB_RAWHID
menu.usb.teensy3.rawhid.fake_serial=teensy_gateway
menu.usb.teensy3.flightsim=Flight Sim Controls
menu.usb.teensy3.flightsim.build.define0=-DUSB_FLIGHTSIM
menu.usb.teensy3.flightsim.fake_serial=teensy_gateway
menu.speed.teensy3.96=96 MHz (overclock)
menu.speed.teensy3.48=48 MHz
menu.speed.teensy3.24=24 MHz
menu.speed.teensy3.96.build.f_cpu=96000000
menu.speed.teensy3.48.build.f_cpu=48000000
menu.speed.teensy3.24.build.f_cpu=24000000
menu.keys.teensy3.en-us=US English
menu.keys.teensy3.en-us.build.define1=-DLAYOUT_US_ENGLISH
menu.keys.teensy3.fr-ca=Canadian French
menu.keys.teensy3.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
menu.keys.teensy3.xx-ca=Canadian Multilingual
menu.keys.teensy3.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
menu.keys.teensy3.da-da=Danish
menu.keys.teensy3.da-da.build.define1=-DLAYOUT_DANISH
menu.keys.teensy3.fi-fi=Finnish
menu.keys.teensy3.fi-fi.build.define1=-DLAYOUT_FINNISH
menu.keys.teensy3.fr-fr=French
menu.keys.teensy3.fr-fr.build.define1=-DLAYOUT_FRENCH
menu.keys.teensy3.fr-be=French Belgian
menu.keys.teensy3.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
menu.keys.teensy3.fr-ch=French Swiss
menu.keys.teensy3.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
menu.keys.teensy3.de-de=German
menu.keys.teensy3.de-de.build.define1=-DLAYOUT_GERMAN
menu.keys.teensy3.de-dm=German (Mac)
menu.keys.teensy3.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
menu.keys.teensy3.de-ch=German Swiss
menu.keys.teensy3.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
menu.keys.teensy3.is-is=Icelandic
menu.keys.teensy3.is-is.build.define1=-DLAYOUT_ICELANDIC
menu.keys.teensy3.en-ie=Irish
menu.keys.teensy3.en-ie.build.define1=-DLAYOUT_IRISH
menu.keys.teensy3.it-it=Italian
menu.keys.teensy3.it-it.build.define1=-DLAYOUT_ITALIAN
menu.keys.teensy3.no-no=Norwegian
menu.keys.teensy3.no-no.build.define1=-DLAYOUT_NORWEGIAN
menu.keys.teensy3.pt-pt=Portuguese
menu.keys.teensy3.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
menu.keys.teensy3.pt-br=Portuguese Brazilian
menu.keys.teensy3.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
menu.keys.teensy3.es-es=Spanish
menu.keys.teensy3.es-es.build.define1=-DLAYOUT_SPANISH
menu.keys.teensy3.es-mx=Spanish Latin America
menu.keys.teensy3.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
menu.keys.teensy3.sv-se=Swedish
menu.keys.teensy3.sv-se.build.define1=-DLAYOUT_SWEDISH
menu.keys.teensy3.en-gb=United Kingdom
menu.keys.teensy3.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
menu.keys.teensy3.usint=US International
menu.keys.teensy3.usint.build.define1=-DLAYOUT_US_INTERNATIONAL




teensy3.build.use_archiver=false
teensy3.recipe.c.o.pattern="{compiler.sam.path}arm-none-eabi-gcc" -c -g -Os -w -ffunction-sections -fdata-sections -nostdlib  -mcpu={build.mcu} -DF_CPU={build.f_cpu} -DTIME_T=1365449461 {build.define0} {build.define1} -MMD -D{software}={runtime.ide.version} {build.extra_flags} -mthumb  -D__MK20DX128__  {includes} "{source_file}" -o "{object_file}"
teensy3.recipe.cpp.o.pattern="{compiler.sam.path}arm-none-eabi-g++" -c -g -Os -w -ffunction-sections -fdata-sections -nostdlib -fno-rtti -fno-exceptions -mcpu={build.mcu} -DF_CPU={build.f_cpu} {build.define0} {build.define1} -MMD -D{software}={runtime.ide.version} {build.extra_flags} -mthumb  -D__MK20DX128__  -felide-constructors -std=gnu++0x {includes} "{source_file}" -o "{object_file}"
teensy3.recipe.ar.pattern="{compiler.sam.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
teensy3.recipe.c.combine.pattern="{compiler.sam.path}arm-none-eabi-gcc"  -Os -Wl,--gc-sections -mcpu={build.mcu} -mthumb "-T{runtime.hardware.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -lm 
teensy3.recipe.objcopy.eep.pattern="{compiler.sam.path}arm-none-eabi-objcopy" -O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0 "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep" 
teensy3.recipe.objcopy.hex.pattern="{compiler.sam.path}arm-none-eabi-objcopy" -O ihex -R .eeprom "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex" 
teensy3.recipe.size.pattern="{compiler.sam.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"


teensy31.name=Teensy 3.1
teensy31.upload.protocol=halfkay
teensy31.upload.maximum_size=262144
teensy31.upload.maximum_ram_size=65536
teensy31.upload.speed=12000000
teensy31.upload.disable_flushing=true
teensy31.bootloader.path=undefined
teensy31.serial.restart_cmd=true
teensy31.serial.safe_baud_rates_only=true
teensy31.upload.tool=teensy_reboot
teensy31.build.mcu=cortex-m4
teensy31.build.cpu=cortex-m4
teensy31.build.option1=-mthumb
teensy31.build.option2=-nostdlib
teensy31.build.option3=-D__MK20DX256__
teensy31.build.cppoption1=-fno-rtti
teensy31.build.linkoption1=-mthumb
teensy31.build.linkscript=mk20dx256.ld
teensy31.build.architecture=arm-none-eabi
teensy31.build.command.gcc=arm-none-eabi-gcc
teensy31.build.command.g++=arm-none-eabi-g++
teensy31.build.command.ar=arm-none-eabi-ar
teensy31.build.command.objcopy=arm-none-eabi-objcopy
teensy31.build.command.objdump=arm-none-eabi-objdump
teensy31.build.command.size=arm-none-eabi-size
teensy31.build.core=teensy3
teensy31.build.noarchive=true
teensy31.build.elide_constructors=true
teensy31.build.gnu0x=true
teensy31.build.dependency=true
teensy31.build.time_t=true
teensy31.build.ldscript=teensy/all/cores/teensy3/mk20dx256.ld
#teensy31.build.linker_relaxation=true
teensy31.build.post_compile_script=teensy_post_compile
#teensy31.build.serial_number=true
teensy31.menu.usb.serial=Serial
teensy31.menu.usb.serial.build.define0=-DUSB_SERIAL
teensy31.menu.usb.hid=Keyboard + Mouse + Joystick
menu.usb.teensy31.hid.build.define0=-DUSB_HID
menu.usb.teensy31.hid.fake_serial=teensy_gateway
menu.usb.teensy31.serialhid=Serial + Keyboard + Mouse + Joystick
menu.usb.teensy31.serialhid.build.define0=-DUSB_SERIAL_HID
#menu.usb.teensy31.int_disk=Disk(Internal) + Keyboard
#menu.usb.teensy31.int_disk.build.define0=-DUSB_DISK
#menu.usb.teensy31.int_disk.fake_serial=teensy_gateway
#menu.usb.teensy31.int_disk.build.elfpatch=mktinyfat
#menu.usb.teensy31.sd_disk=Disk(SD Card) + Keyboard
#menu.usb.teensy31.sd_disk.build.define0=-DUSB_DISK_SDFLASH
#menu.usb.teensy31.sd_disk.fake_serial=teensy_gateway
menu.usb.teensy31.midi=MIDI
menu.usb.teensy31.midi.build.define0=-DUSB_MIDI
menu.usb.teensy31.midi.fake_serial=teensy_gateway
menu.usb.teensy31.rawhid=Raw HID
menu.usb.teensy31.rawhid.build.define0=-DUSB_RAWHID
menu.usb.teensy31.rawhid.fake_serial=teensy_gateway
menu.usb.teensy31.flightsim=Flight Sim Controls
menu.usb.teensy31.flightsim.build.define0=-DUSB_FLIGHTSIM
menu.usb.teensy31.flightsim.fake_serial=teensy_gateway
menu.speed.teensy31.96=96 MHz (overclock)
menu.speed.teensy31.48=48 MHz
menu.speed.teensy31.24=24 MHz
menu.speed.teensy31.96.build.f_cpu=96000000
menu.speed.teensy31.48.build.f_cpu=48000000
menu.speed.teensy31.24.build.f_cpu=24000000
menu.keys.teensy31.en-us=US English
menu.keys.teensy31.en-us.build.define1=-DLAYOUT_US_ENGLISH
menu.keys.teensy31.fr-ca=Canadian French
menu.keys.teensy31.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
menu.keys.teensy31.xx-ca=Canadian Multilingual
menu.keys.teensy31.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
menu.keys.teensy31.da-da=Danish
menu.keys.teensy31.da-da.build.define1=-DLAYOUT_DANISH
menu.keys.teensy31.fi-fi=Finnish
menu.keys.teensy31.fi-fi.build.define1=-DLAYOUT_FINNISH
menu.keys.teensy31.fr-fr=French
menu.keys.teensy31.fr-fr.build.define1=-DLAYOUT_FRENCH
menu.keys.teensy31.fr-be=French Belgian
menu.keys.teensy31.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
menu.keys.teensy31.fr-ch=French Swiss
menu.keys.teensy31.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
menu.keys.teensy31.de-de=German
menu.keys.teensy31.de-de.build.define1=-DLAYOUT_GERMAN
menu.keys.teensy31.de-dm=German (Mac)
menu.keys.teensy31.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
menu.keys.teensy31.de-ch=German Swiss
menu.keys.teensy31.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
menu.keys.teensy31.is-is=Icelandic
menu.keys.teensy31.is-is.build.define1=-DLAYOUT_ICELANDIC
menu.keys.teensy31.en-ie=Irish
menu.keys.teensy31.en-ie.build.define1=-DLAYOUT_IRISH
menu.keys.teensy31.it-it=Italian
menu.keys.teensy31.it-it.build.define1=-DLAYOUT_ITALIAN
menu.keys.teensy31.no-no=Norwegian
menu.keys.teensy31.no-no.build.define1=-DLAYOUT_NORWEGIAN
menu.keys.teensy31.pt-pt=Portuguese
menu.keys.teensy31.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
menu.keys.teensy31.pt-br=Portuguese Brazilian
menu.keys.teensy31.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
menu.keys.teensy31.es-es=Spanish
menu.keys.teensy31.es-es.build.define1=-DLAYOUT_SPANISH
menu.keys.teensy31.es-mx=Spanish Latin America
menu.keys.teensy31.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
menu.keys.teensy31.sv-se=Swedish
menu.keys.teensy31.sv-se.build.define1=-DLAYOUT_SWEDISH
menu.keys.teensy31.tr-tr=Turkish (partial)
menu.keys.teensy31.tr-tr.build.define1=-DLAYOUT_TURKISH
menu.keys.teensy31.en-gb=United Kingdom
menu.keys.teensy31.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
menu.keys.teensy31.usint=US International
menu.keys.teensy31.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensy31.build.use_archiver=false
teensy31.recipe.c.o.pattern="{compiler.sam.path}arm-none-eabi-gcc" -c -g -Os -w -ffunction-sections -fdata-sections -nostdlib  -mcpu={build.mcu} -DF_CPU={build.f_cpu} -DTIME_T=1365449461 {build.define0} {build.define1} -MMD -D{software}={runtime.ide.version} {build.extra_flags} -mthumb  -D__MK20DX256__  {includes} "{source_file}" -o "{object_file}"
teensy31.recipe.cpp.o.pattern="{compiler.sam.path}arm-none-eabi-g++" -c -g -Os -w -ffunction-sections -fdata-sections -nostdlib -fno-rtti -fno-exceptions -mcpu={build.mcu} -DF_CPU={build.f_cpu} {build.define0} {build.define1} -MMD -D{software}={runtime.ide.version} {build.extra_flags} -mthumb  -D__MK20DX256__  -felide-constructors -std=gnu++0x {includes} "{source_file}" -o "{object_file}"
teensy31.recipe.ar.pattern="{compiler.sam.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
teensy31.recipe.c.combine.pattern="{compiler.sam.path}arm-none-eabi-gcc"  -Os -Wl,--gc-sections -mcpu={build.mcu} -mthumb "-T{runtime.hardware.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -lm 
teensy31.recipe.objcopy.eep.pattern="{compiler.sam.path}arm-none-eabi-objcopy" -O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0 "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep" 
teensy31.recipe.objcopy.hex.pattern="{compiler.sam.path}arm-none-eabi-objcopy" -O ihex -R .eeprom "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex" 
teensy31.recipe.size.pattern="{compiler.sam.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"